{"CS": "Computer Science is the study of algorithms and problem solving.", "Medical": "Study and treatment of diseases and disorders in human beings.", "Psychology": "The scientific study of the mind and behavior of individuals.", "Civil": "Civil is a social order governed by laws and conventions.", "ECE": "ECE (Electrical and Computer Engineering) is a field that combines electronics and computing.", "biochemistry": "Study of chemical processes within living organisms and their molecules.", "MAE": "A mathematical model that evaluates average magnitude of error.", "Parallel computing": "Parallel computing involves multiple processors working together to solve problems efficiently.", "Irritable Bowel Syndrome": "Chronic digestive disorder causing abdominal pain, bloating, and irregular bowel movements.", "Bioinformatics": "Integration of biology, computer science, and statistics to analyze data.", "Skin Care": "Removing makeup, cleansing, exfoliating, toning, moisturizing, anti-aging, protecting, nourishing, repairing, glowing.", "Child abuse": "Child abuse: harmful actions causing physical, emotional, or sexual harm.", "Antisocial personality disorder": "Chronic pattern of disregard for others' rights and lack of empathy.", "Smart Material": "Materials that can change their properties in response to external stimuli.", "State space representation": "A state space representation is a mathematical model of a system.", "Computer programming": "Computer programming is the process of creating software using code.", "Southern blotting": "Technique to detect specific DNA sequences using hybridization and electrophoresis.", "Smoking Cessation": "The process of quitting smoking to improve overall health.", "Alzheimer's Disease": "Neurodegenerative disorder causing memory loss, confusion, and cognitive decline.", "computer-aided design": "Computer software to create precise and detailed 2D/3D designs.", "Microcontroller": "A small computer on a chip used for embedded systems.", "Electricity": "Electricity is the flow of energy through conductive materials, powering devices.", "Atopic Dermatitis": "Chronic skin condition causing itchy, inflamed, and scaly patches.", "Immunology": "Study of the immune system's response to pathogens and diseases.", "False memories": "Misleading recollections confused as real experiences in the past.", "Enzymology": "Enzymology: Study of enzymes and their biochemical properties and functions.", "Osteoarthritis": "Degenerative joint disease causing pain, stiffness, and limited mobility.", "Image processing": "\"Manipulating and analyzing digital images using computer algorithms and techniques.\"", "Attention": "Attention: Focused awareness on something important or of interest.", "Operating systems": "Software that manages computer hardware and software resources and operations.", "Materials Engineering": "Study of properties, structure, and processing of materials for applications.", "Diabetes": "Chronic condition affecting blood sugar levels, requires management and treatment.", "Sprains and Strains": "Injuries to ligaments (sprains) or muscles and tendons (strains).", "Healthy Sleep": "Restful, uninterrupted, rejuvenating, deep, quality, regular, essential, refreshing, energizing, balanced.", "Dementia": "Progressive neurodegenerative disorder leading to memory loss and cognitive decline.", "Bipolar Disorder": "Mood swings, extremes, manic episodes, depressive episodes, unpredictable and challenging disorder.", "Analog signal processing": "Amplification, filtering, modulation, demodulation, mixing, encoding, decoding, signal conditioning, analog-to-digital conversion.", "Rheumatoid Arthritis": "Chronic inflammatory disease causing joint pain, swelling, and stiffness.", "Thermodynamics": "Study of energy and its transformations in physical systems.", "Signal-flow graph": "A visual representation of a system's input-output relationship.", "Media violence": "Depiction of aggression in various forms on various media platforms.", "Software engineering": "\"Process of designing, developing, testing, and maintaining computer software.\"", "Atrial Fibrillation": "Atrial fibrillation is an irregular and rapid heart rhythm.", "Relational databases": "Tables, Rows, Columns, Keys, Relationships, Normalization, Indexes, Joins, Data Integrity", "System identification": "System identification is the process of modeling and analyzing systems.", "Cell biology": "Study of cells and their structures, functions, and interactions.", "Ambient Intelligence": "Smart technology creating seamless interactions within a person's environment.", "Depression": "Persistent sadness, lack of energy, loss of interest, feelings of hopelessness.", "Eating disorders": "Psychological disorders associated with disturbed eating patterns and body image.", "Sports Injuries": "Common, impactful, range from minor to severe, require medical attention.", "Cryptography": "Cryptography is the science of secure communication through encryption methods.", "Heart Disease": "Heart disease is a major health condition affecting cardiovascular system.", "Geotextile": "Geotextile: woven fabric used for stabilizing and separating soil and rock.", "Stress Management": "Strategies to reduce and cope with stress for better well-being.", "Water Pollution": "Contamination of water bodies due to human activities or waste.", "Leadership": "Inspiring, influential, decisive, empathetic, visionary, trustworthy, effective communicator, problem solver, resilient.", "Solar Energy": "Renewable energy from the sun that provides sustainable power.", "Person perception": "Person perception involves forming impressions of others based on observations.", "Children's Health": "\"The wellbeing of kids through proper nutrition, exercise, and care.\"", "Headache": "Pain in the head that can be throbbing or dull.", "PID controller": "Proportional, Integral, Derivative controller used to regulate system behavior.", "Electric motor": "A device that converts electrical energy into mechanical energy efficiently.", "Osteoporosis": "Osteoporosis is a bone disease causing weak and fragile bones.", "Suspension Bridge": "A bridge supported by cables hanging from tall towers.", "Medicare": "Medicare: government program providing health insurance for elderly and disabled.", "Distributed computing": "\"Distributed computing is a system where tasks are divided and processed.\"", "Strength of materials": "Study of behavior and resistance of materials under applied forces.", "Fluid mechanics": "Study of fluids in motion, forces and properties impact.", "Hereditary Angioedema": "Hereditary condition causing recurrent episodes of swelling and inflammation.", "Algorithm design": "Algorithm design is the process of creating step-by-step instructions.\n", "Northern blotting": "Technique to detect RNA molecules using gel electrophoresis and hybridization.", "Digital control": "Digital control is the use of digital logic for system control.", "Internal combustion engine": "Combustion engine that converts fuel into mechanical energy.", "Gender roles": "Gender roles define societal expectations for behavior based on sex.", "Emergency Contraception": "\"Time-sensitive pill to prevent pregnancy after unprotected sex or contraception failure.\"", "Multiple Sclerosis": "Chronic disease affecting the central nervous system causing various symptoms.", "Low Testosterone": "Low testosterone is a condition characterized by insufficient hormone levels.", "Autism": "Neurodevelopmental disorder impacting social interaction, communication, and repetitive behaviors.", "Addiction": "Compulsive behavior, dependence, and inability to quit harmful substances or activities.", "Green Building": "Sustainable, energy-efficient, environmentally-friendly, resource-efficient, non-toxic, healthy, low-impact, innovative, conservation-minded, responsible", "network security": "Protection of computer networks against unauthorized access and malicious activities.", "Hepatitis C": "Hepatitis C: a viral infection affecting the liver; can be chronic.", "Computer vision": "Computer vision is the study of machines understanding visual data.", "Manufacturing engineering": "Manufacturing engineering involves designing, developing, and improving production processes.", "Idiopathic Pulmonary Fibrosis": "Idiopathic Pulmonary Fibrosis: Progressive lung scarring with unknown cause and limited treatment options.", "Operational amplifier": "Operational amplifier is a high-gain electronic device used for amplification.", "Machine design": "Process of creating physical components and systems using engineering principles.", "Myelofibrosis": "Progressive bone marrow disorder causing fibrosis, anemia, and enlarged spleen.", "Overactive Bladder": "Frequent urination, urgency, and incontinence due to bladder muscle overactivity.", "Electrical circuits": "Electricity flows through wires to power devices and create circuits.", "Computer graphics": "Visual representation of images or objects on a digital platform.", "Crohn's Disease": "Chronic inflammatory bowel disease causing abdominal pain and digestive issues.", "Lymphoma": "Lymphoma is a type of cancer that affects the lymphocytes.", "Schizophrenia": "Psychotic disorder with altered perception, delusions, hallucinations, and impaired cognition.", "Prenatal development": "The process of growth and development before birth in humans.", "Remote Sensing": "\"Remote sensing is the collection of data from a distance.\"", "Seasonal affective disorder": "Seasonal affective disorder: winter blues, low mood, lack of energy, depression.", "Molecular biology": "Study of biological processes at the molecular level using techniques.", "Hypothyroidism": "Underactive thyroid; fatigue, weight gain, dry skin, and depression.", "Polycythemia Vera": "Polycythemia Vera is a rare blood disorder characterized by excess red blood cells.", "Genetics": "Study of genes, heredity, and variations in living organisms.", "Parenting": "Nurturing, guiding, teaching, supporting, loving, patient, disciplining, fostering independence, role modeling, unconditional love", "Polymerase chain reaction": "A technique to amplify DNA in vitro exponentially.", "Menopause": "Natural biological process when female reproductive hormones decline, ending menstruation.", "Hydraulics": "Study of fluids in motion, pumps, and engineering systems.", "Parkinson's Disease": "Parkinson's Disease is a neurodegenerative disorder affecting movement and coordination.", "Rainwater Harvesting": "Collecting and storing rainwater for future use and conservation.", "Construction Management": "Construction management is the oversight and coordination of construction projects.", "Machine learning": "\"Algorithmic methods for training computers to learn and make predictions.\"", "Digestive Health": "Digestive health refers to the proper functioning of the digestive system.", "Social cognition": "The study of how people perceive, interpret, and understand others.", "Electrical network": "An interconnected system of electrical components for power distribution.", "Anxiety": "Excessive worry and fear that interfere with daily life.", "Fungal Infection": "Fungal infection is a contagious skin condition caused by fungi.", "HIV/AIDS": "HIV/AIDS: a contagious viral infection affecting the immune system.", "Data structures": "Data structures are used to organize and store data efficiently.", "Problem-solving": "Identifying, analyzing, and resolving challenges using logical and systematic approaches.", "Prosocial behavior": "Helping others with positive intentions, benefitting society and individuals.", "Allergies": "An immune response to specific substances, causing physical discomfort or reactions.", "Prejudice": "Unfair judgment based on preconceived notions about a person or group.", "Human Metabolism": "The complex biochemical processes that sustain life and produce energy.", "Psoriatic Arthritis": "Chronic inflammatory joint disease with skin involvement and psoriasis association.", "Kidney Health": "Maintaining good hydration, diet and regular check-ups promotes kidney health.", "Stealth Technology": "Advanced technology used to minimize detection by radar and sonar.", "Control engineering": "Control engineering is the use of feedback to regulate systems.", "Asthma": "Chronic respiratory condition causing breathlessness, coughing, wheezing, and chest tightness.", "Nonverbal communication": "Nonverbal communication: Expressing without words through gestures, facial expressions, and body language.", "Ankylosing Spondylitis": "Chronic inflammatory arthritis affecting the spine and other joints.", "Birth Control": "Method to prevent pregnancy, includes various options such as pills, devices.", "Borderline personality disorder": "Instability, intense emotions, fear of abandonment, self-destructive behaviors, identity confusion.", "Senior Health": "Senior health focuses on maintaining wellness and quality of life.", "Migraine": "Severe headache with symptoms like nausea, sensitivity to light and sound.", "Symbolic computation": "Symbolic computation involves performing mathematical operations using symbols instead of numbers.", "Psoriasis": "Chronic skin condition causing red, scaly patches with itching.", "Cancer": "Cancer is a disease characterized by abnormal cell growth.", "Mental Health": "Mental health covers emotional, psychological, and social wellbeing.", "Weight Loss": "Healthy eating, exercise, portion control, consistency, hydration, sleep, self-care, support", "Structured Storage": "Structured Storage is a file system-like storage mechanism for Windows.", "Voltage law": "Voltage law states that the sum of voltages in a circuit is zero.", "Lorentz force law": "The Lorentz force law describes the force on a charged particle.", "Electrical generator": "Device that converts mechanical energy into electrical energy through electromagnetic induction."}